Public Member Functions | Friends | List of all members
ACAPI::LicenseInfo::ProductVersionInfo Class Reference
LicenseInfo
ProductVersionInfo is the central point of the product-related informations. More...
#include <ProductVersionInfo.hpp>
 Inheritance diagram for ACAPI::LicenseInfo::ProductVersionInfo:
 Public Member Functions
GS::UniString  | GetProductFamilyId () const
GS::UniString  | GetProductName () const
GS::UniString  | GetGSLanguageCode () const
GS::UniString  | GetGSProductType () const
GS::UniString  | GetAppVersionString () const
GS::UniString  | GetMainVersionString () const
GS::UniString  | GetUpdateVersionString () const
GS::UniString  | GetHotfixVersionString () const
Int32  | GetBuildNum () const
 Public Member Functions inherited from ACAPI::Object
Object (std::shared_ptr< Impl::ObjectImpl > impl)
Constructs a new object.
const API_Token &  | GetToken () const
Get the token for this object.
 Friends
 class  | Impl::LicenseInfoManagerImpl
 Additional Inherited Members
 Protected Member Functions inherited from ACAPI::Object
~Object ()
Default destructor.
 Protected Attributes inherited from ACAPI::Object
 std::shared_ptr< Impl::ObjectImpl >  | mImpl
Impl object given by constructor.
Detailed Description
ProductVersionInfo is the central point of the product-related informations.
Since
Archicad 28